docs/blog/2024-08-21-decorator-design-pattern-in-cpp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-14 Tue 13:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Decorator design pattern</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
<header><a href="./">Home</a>
</header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Decorator design pattern</h1>
<div class="org-src-container">
<pre class="src src-cpp">  <span style="font-weight: bold; text-decoration: underline;">include</span> &lt;iostream&gt;
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;string&gt;</span>
<span style="font-weight: bold;">#include</span> <span style="font-style: italic;">&lt;memory&gt;</span>
<span style="font-style: italic;">/**</span>
<span style="font-style: italic;"> * The base Component interface </span>
<span style="font-style: italic;"> */</span>
<span style="font-weight: bold;">class</span> Component {
 <span style="font-weight: bold;">public</span>:
  <span style="font-weight: bold;">Component</span>(){<span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"[Constructor] Component\n"</span>;}
  <span style="font-weight: bold;">virtual</span> ~<span style="font-weight: bold;">Component</span>(){<span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"[Destructor] Component\n"</span>;}
  <span style="font-weight: bold;">virtual</span> <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">Operation</span>() = 0;
};
<span style="font-style: italic;">/**</span>
<span style="font-style: italic;"> * Concrete Components </span>
<span style="font-style: italic;"> */</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">ConcreteComponent</span> : <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">Component</span> {
 <span style="font-weight: bold;">public</span>:
  <span style="font-weight: bold;">ConcreteComponent</span>(){<span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"[Constructor] ConcreteComponent\n"</span>;}
  ~<span style="font-weight: bold;">ConcreteComponent</span>(){<span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"[Destructor] ConcreteComponent\n"</span>;}
  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">Operation</span>() <span style="font-weight: bold;">override</span> {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"ConcreteComponent"</span>;
  }
};

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Decorator</span> : <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">Component</span> {

 <span style="font-weight: bold;">protected</span>:
  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">unique_ptr</span>&lt;Component&gt; <span style="font-weight: bold; font-style: italic;">component_</span>;

 <span style="font-weight: bold;">public</span>:

  <span style="font-weight: bold;">Decorator</span>( <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">unique_ptr</span>&lt;Component&gt; <span style="font-weight: bold; font-style: italic;">component</span>)  {
      component_=<span style="font-weight: bold; text-decoration: underline;">std</span>::move(component);
      <span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"[Constructor] Decorator\n"</span>;
  }
  ~<span style="font-weight: bold;">Decorator</span>(){<span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"[Destructor] Decorator\n"</span>;}


  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">Operation</span>()  <span style="font-weight: bold;">override</span> {
    <span style="font-weight: bold;">this</span>-&gt;component_-&gt;Operation();
  }
};

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">ConcreteDecorator</span> : <span style="font-weight: bold;">public</span> <span style="font-weight: bold; text-decoration: underline;">Decorator</span> {

 <span style="font-weight: bold;">public</span>:

  <span style="font-weight: bold;">ConcreteDecorator</span>( <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">unique_ptr</span>&lt;Component&gt; <span style="font-weight: bold; font-style: italic;">component</span>) : Decorator(<span style="font-weight: bold; text-decoration: underline;">std</span>::move(component)) {
      <span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"[Constructor] ConcreteDecorator\n"</span>;
  }
  ~<span style="font-weight: bold;">ConcreteDecorator</span>() {<span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">"[Destructor] ConcreteDecoratorA\n"</span>;}
  <span style="font-weight: bold; text-decoration: underline;">void</span> <span style="font-weight: bold;">Operation</span>()  <span style="font-weight: bold;">override</span> {
    <span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt; <span style="font-style: italic;">"ConcreteDecorator("</span>; <span style="font-weight: bold; text-decoration: underline;">Decorator</span>::Operation(); <span style="font-weight: bold; text-decoration: underline;">std</span>::cout&lt;&lt;<span style="font-style: italic;">")"</span>;
  }
};


<span style="font-weight: bold; text-decoration: underline;">int</span> <span style="font-weight: bold;">main</span>() {

  <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">unique_ptr</span>&lt;Component&gt; <span style="font-weight: bold; font-style: italic;">simple</span>=<span style="font-weight: bold; text-decoration: underline;">std</span>::make_unique&lt;<span style="font-weight: bold; text-decoration: underline;">ConcreteComponent</span>&gt;();
  <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="font-style: italic;">"Client: I've got a simple component:\n"</span>;
  simple-&gt;Operation();
  <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="font-style: italic;">"\n\n"</span>;

   <span style="font-weight: bold; text-decoration: underline;">std</span>::<span style="font-weight: bold; text-decoration: underline;">unique_ptr</span>&lt;Component&gt; <span style="font-weight: bold; font-style: italic;">decorator</span> = <span style="font-weight: bold; text-decoration: underline;">std</span>::make_unique&lt;<span style="font-weight: bold; text-decoration: underline;">ConcreteDecorator</span>&gt;(<span style="font-weight: bold; text-decoration: underline;">std</span>::move(simple));
   <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="font-style: italic;">"Client: Now I've got a decorated component:\n"</span>;
   decorator-&gt;Operation();
   <span style="font-weight: bold; text-decoration: underline;">std</span>::cout &lt;&lt; <span style="font-style: italic;">"\n"</span>;



  <span style="font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-08-21</p>
<p class="date">Created: 2025-01-14 Tue 13:28</p>
</div>
</body>
</html>
